[
  {
    "status": "success",
    "totalResults": 48,
    "results": [
      {
        "title": "Analysis-Regulators dust off rule books to tackle generative AI like ChatGPT",
        "link": "https://www.thestar.com.my/tech/tech-news/2023/05/22/analysis-regulators-dust-off-rule-books-to-tackle-generative-ai-like-chatgpt",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "LONDON/STOCKHOLM (Reuters) - As the race to develop more powerful artificial intelligence services like ChatGPT accelerates, some regulators are relying on old laws to control a technology that could upend the way societies and businesses operate. Read full story",
        "content": null,
        "pubDate": "2023-05-22 05:03:00",
        "image_url": "https://apicms.thestar.com.my/uploads/images/2023/05/22/2084799.jpg",
        "source_id": "thestar_my",
        "category": ["technology"],
        "country": ["malaysia"],
        "language": "english"
      },
      {
        "title": "LinkedIn Suffering From Fake Commenters",
        "link": "https://www.channelnews.com.au/linkedin-suffering-from-fake-commenters/",
        "keywords": [
          "Latest News",
          "AI",
          "cyber attacks",
          "cyber-security",
          "Fake Profiles",
          "LinkedIn"
        ],
        "creator": ["Ashley Riordan"],
        "video_url": null,
        "description": "LinkedIn has been suffering a growing tide of misinformation, blocking over 58mn accounts recently. This is up from 22mn. Systems are in place to prevent profile cloning and spam accounts, however, artificial intelligence (AI) has made it harder to identify them. It was reported that over 1,000 active accounts were using faces created by AI.... Read More",
        "content": "LinkedIn has been suffering a growing tide of misinformation, blocking over 58mn accounts recently. This is up from 22mn. Systems are in place to prevent profile cloning and spam accounts, however, artificial intelligence (AI) has made it harder to identify them. It was reported that over 1,000 active accounts were using faces created by AI. Shalinda Adikari and Kaushik Dutta from Cornell University wrote a paper that said, “Fake profiles have an adverse effect on the trustworthiness of the network as a whole, and can represent significant costs in time and effort in building a connection based on fake information.” Research has shown that targeting recently created profiles without an avatar, narrow engagement, and limited biographical information could weed out fakes with a high accuracy. LinkedIn does not currently apply this. Constantly ranking towards the top for phishing attempts, over half companies just situated in the US alone have been reporting targets by scammers on the site. There have been reports by LinkedIn saying it was strengthening systems to keep “inauthentic profiles and activity” off the platform. This included making it public when accounts were created, and adding phone and email verifications. A LinkedIn spokesperson has said, “We use technology and teams of experts to help keep our community safe and trustworthy. 99 per cent percent of detected spam and scams were removed by our automated defenses and 99.6 per cent of detected fake accounts were blocked before members reported them. When we receive reports of fake accounts we quickly take action, as we did in this case.”",
        "pubDate": "2023-05-22 01:40:48",
        "image_url": null,
        "source_id": "channelnews",
        "category": ["technology"],
        "country": ["australia"],
        "language": "english"
      },
      {
        "title": "Optus Adds AI Gimmicks To Voice Calls",
        "link": "https://www.channelnews.com.au/optus-adds-ai-gimmicks-to-voice-calls/",
        "keywords": ["Latest News", "hey optus", "optus", "optus call effects"],
        "creator": ["Nathan Jolly"],
        "video_url": null,
        "description": "Optus is jumping on the AI bandwagon with Call Effects, which uses artificial intelligence “to add a bit of levity to the standard call”. By saying ‘Hey Optus’ during a phone call, you can “add some joy into everyday phone calls with playful skills” by launching a menu of four AI-powered ‘Call Effects’. 1. Crystal... Read More",
        "content": "Optus is jumping on the AI bandwagon with Call Effects, which uses artificial intelligence “to add a bit of levity to the standard call”. By saying ‘Hey Optus’ during a phone call, you can “add some joy into everyday phone calls with playful skills” by launching a menu of four AI-powered ‘Call Effects’. 1. Crystal Ball – Request answers to life’s deepest questions; 2. Coin Toss – Flip a coin and let fate decide; 3. Dinner Roulette – Can’t decide what to eat? Spin the wheel; 4. 21 Questions – Get to know each other. Optus Call Effects appears to have zero practical application, and seems like a clumsy concept, aimed at a generation who simply don’t make phone calls. It seems unlikely to “bring fun and evolve the way friends and family connect on the traditional phone call”, as Optus is hoping. “As part of creating an innovative network experience, our latest Living Network feature uses AI technology in the traditional phone call, delivering a fun experience exclusively for our customers,” Matt Williams, Optus Managing Director, Marketing and Revenue, said. “Messaging has emojis, video has AR filters, and now phone calls on the Optus network have Call Effects,” he added, hopefully. Optus Call Effects will be made available to all customers “free of charge” via the My Optus app.  ",
        "pubDate": "2023-05-22 00:56:48",
        "image_url": null,
        "source_id": "channelnews",
        "category": ["technology"],
        "country": ["australia"],
        "language": "english"
      },
      {
        "title": "Revolution in AI technology: XeroTech debuts AIA",
        "link": "https://www.24newshd.tv/21-May-2023/revolution-in-ai-technology-xerotech-debuts-aia",
        "keywords": ["Topics, Science & Tech"],
        "creator": ["News Desk"],
        "video_url": null,
        "description": "A Dubai-based trailblazer in advanced artificial intelligence, Xerotech, has announced the unveiling of their revolutionary, patent-pending technology, the Alena Intelligent Avatar (AIA).",
        "content": "A Dubai-based trailblazer in advanced artificial intelligence, Xerotech, has announced the unveiling of their revolutionary, patent-pending technology, the Alena Intelligent Avatar (AIA). Infused with the next-generation tech stack including AI, IoT, Blockchain, Metaverse, and XR, Xerotech and its R&D subsidiary CRAFT Systems, based in Islamabad, Pakistan, are redefining the frontiers of human-computer interaction. Building on the momentum of OpenAI's GPT-4, Xerotech introduces an unmatched level of real-time AI interaction. Users are now able to see, hear and speak to AIA just like a video chat with a real person. It's as if the AI has come to life in a virtual form. This unprecedented immersion extends beyond mere text-based interaction, as users can now assign tasks, seek advice or hold a video conference with one or more AIA and real humans. This innovative solution seamlessly integrates advanced speech-to-text, text-to-speech, natural language processing, and facial animation technologies. The result? AIA, an engaging and interactive virtual companion with human-like emotional intelligence, expressions, and communication capabilities that brings a new depth to digital experiences. AIA's potential spans countless sectors. As a personal assistant, mentor, companion, newscaster, event host, language translator, gaming companion, and even virtual CEO, AIA is poised to transform industries including healthcare, education, entertainment, customer service, and many more. Its adaptability offers extensive applications that will redefine the way we interact with technology. Xerotech invites forward-thinking investors to participate in this game-changing journey. Investment in this patent-pending technology will fuel further R&D, enabling expanded applications and scalability of the AIA. A standout feature of AIA is the concept of \"Virtual Immortality.\" With user permission, the AI avatar learns and imitates user's traits and preferences, providing an enduring digital representation. In the event of the user's passing, AIA can interact with loved ones in a manner reminiscent of the user's unique personality, offering a unique form of solace and emotional support. Xerotech, headquartered in Dubai, UAE, with its R&D arm, CRAFT Systems in Islamabad, Pakistan, is at the forefront of AI technology, creating the future of human-digital interaction. Led by Founder and CEO Noman Shah, an inventor with over 30 patents in his portfolio, the team at Xerotech brings AI innovation to the global stage. \"We see AIA as the next monumental step in AI technology, building on the incredible accomplishments of GPT-4,\" said Noman Shah. \"We invite investors to join us in our mission to redefine human-digital interaction.\"",
        "pubDate": "2023-05-21 15:55:25",
        "image_url": "https://www.24newshd.tv/digital_images/large/2023-05-21/revolution-in-ai-technology-xerotech-debuts-aia-1684684515-4090.jpg",
        "source_id": "newshd24",
        "category": ["technology"],
        "country": ["pakistan"],
        "language": "english"
      },
      {
        "title": "AI Expert Says ChatGPT Is Way Stupider Than People Realize",
        "link": "https://futurism.com/the-byte/ai-expert-chatgpt-way-stupider",
        "keywords": [
          "Artificial Intelligence",
          "large language models",
          "OpenAI",
          "the digest"
        ],
        "creator": ["Victor Tangermann"],
        "video_url": null,
        "description": "AI'm With Stupid Robotics researcher and AI expert Rodney Brooks is arguing that we've been vastly overestimating OpenAI's large language models, on which its blockbuster chatbot ChatGPT is based. In an interview with IEEE Spectrum, Brooks pointed out that these tools are a lot stupider than we give them credit for. He also argued that […]",
        "content": "AI'm With Stupid Robotics researcher and AI expert Rodney Brooks is arguing that we've been vastly overestimating OpenAI's large language models, on which its blockbuster chatbot ChatGPT is based on. In a terrific interview with IEEE Spectrum, Brooks argues that these tools are a lot stupider than we realize, not to mention a very far cry from being able to compete with humans at any given task on an intellectual level. Overall, he says, we're guilty of a lot of sins of poorly predicting the future of AI. Long story short, is AI poised to become the sort of artificial general intelligence (AGI) that could operate at a similar intellectual level to humans? \"No, because it doesn’t have any underlying model of the world,\" Brooks told the publication. \"It doesn’t have any connection to the world. It is correlation between language.\" Reality Check Brooks' comments serve as a valuable reminder of the current limitations plaguing AI tech, and how easy it is to imbue their output with meaning even though they were engineered to simply sound — rather than reason — like humans. \"We see a person do something, and we know what else they can do, and we can make a judgment quickly,\" he told IEEE Spectrum. \"But our models for generalizing from a performance to a competence don’t apply to AI systems.\" In other words, current language models aren't able to logically infer meaning, despite them making it sound like they can — which can easily mislead the user. \"What the large language models are good at is saying what an answer should sound like, which is different from what an answer should be,\" Brooks said. Completely Wrong The researcher said that he's been experimenting with large language models to help him with \"arcane coding\" — but ran into some serious trouble. \"It gives an answer with complete confidence, and I sort of believe it,\" Brooks told IEEE Spectrum. \"And half the time, it’s completely wrong. And I spend two or three hours using that hint, and then I say, 'That didn’t work,' and it just does this other thing.\" \"Now, that’s not the same as intelligence,\" he added. \"It’s not the same as interacting. It’s looking it up.\" In short, Brooks believes future iterations of the tech could end up in some interesting places — \"but not AGI.\" And given the risks involved in having an AI system supersede the intelligence of a human being, it's probably better that way. More on ChatGPT: ChatGPT Happy to Write Smut About Freakishly Obscure Sex Act The post AI Expert Says ChatGPT Is Way Stupider Than People Realize appeared first on Futurism.",
        "pubDate": "2023-05-21 15:45:18",
        "image_url": null,
        "source_id": "futurism",
        "category": ["science", "technology"],
        "country": ["united states of america"],
        "language": "english"
      },
      {
        "title": "How will artificial intelligence change the world in 2030?.. Experts answer",
        "link": "https://thenewsglory.com/how-will-artificial-intelligence-change-the-world-in-2030-experts-answer/",
        "keywords": ["Tech"],
        "creator": ["The News Glory"],
        "video_url": null,
        "description": "With the rapid progress of artificial intelligence, there are multiple expectations about the role that this technology will play in human life, and what the world will look like in the coming years. Experts expect that artificial intelligence will be able to take care of the elderly, or make movies and give lessons, or even […]",
        "content": "With the rapid progress of artificial intelligence, there are multiple expectations about the role that this technology will play in human life, and what the world will look like in the coming years. Experts expect that artificial intelligence will be able to take care of the elderly, or make movies and give lessons, or even can eliminate the human race, by 2030, according to a report by the British Daily Mail. The writer of the sci-fi series “Silo” Mr Howey predicted that AI technology would become so good that it would start producing entire films within a day. AI also has the potential to transform the education sector and tailor lesson plans around the classroom, predicts Dr. Ajaz Ali, Head of Business and Computing at Ravensbourne University in London. eradication of the human race And amid suggestions that artificial intelligence will improve our lives immeasurably, there are also experts who warn that it could wipe out the human race by 2030. Among the pessimists is the American computer scientist Eliezer Yudkovsky, who bets that the human race will be completely wiped out by January 1, 2030. Other leading experts who say AI could destroy civilization include billionaire Elon Musk and British scientist Stephen Hawking, though they did not mean to suggest that all humans will be wiped out by 2030. Enhance the value of the economy In parallel, experts also suggest that artificial intelligence can boost the value of the global economy by $15.7 trillion by 2030, or more than the value of the economies of India and China combined, and by a fifth compared to current levels. This was predicted by analysts working for the “Big Four” accounting firm PwC, based in London. Expressive (iStock) Solve the energy crisis In addition, experts also suggested that artificial intelligence could solve the energy crisis in the world by 2030, especially after the recent crisis, which erupted due to a combination of the Ukraine war, which led to the prevention of fossil fuel imports from Russia, and the sudden increase in demand during the economic recovery. After the covid pandemic. Intelligence similar to human intelligence Predictions also abound that artificial intelligence could reach human-like intelligence by 2030. Among those who sounded the warning was former Google engineer Ray Kurzweil, a famous futurist who claims predictions have an 86% success rate. Anticipate medical problems In healthcare, AI can predict problems before they occur by 2030, says AI expert Simon Payne, founder and CEO of the software company OmniIndex, based in San Jose, California. Also within the next decade, AI could take on as big a role in caring for the elderly as the ElliQ robot, says Heather Delaney, founder of the London-based PR firm.",
        "pubDate": "2023-05-21 09:31:45",
        "image_url": null,
        "source_id": "thenewsglory",
        "category": ["technology"],
        "country": ["india"],
        "language": "english"
      },
      {
        "title": "Unlocking the trillion-dollar female economy",
        "link": "https://techcrunch.com/2023/05/21/unlocking-the-trillion-dollar-female-economy/",
        "keywords": [
          "Startups",
          "Venture",
          "Column",
          "DEI",
          "Opinion",
          "TechCrunch Opinion",
          "venture capital",
          "women's health"
        ],
        "creator": ["Walter Thompson"],
        "video_url": null,
        "description": "Women should no longer be thought of as a niche. In fact, they’re one of the most significant growth markets we’ve ever seen. Unlocking the trillion-dollar female economy by Walter Thompson originally published on TechCrunch",
        "content": "Monique Woodard Contributor Share on Twitter Monique Woodard is the founder and managing director of Cake Ventures. As women have gained economic power, their economic influence has expanded. Women long held primary purchasing responsibility for everyday household items, but today, they control or influence 85% of consumer spending. I founded Cake Ventures as a venture capital firm that invests in technology companies that address our world’s rapidly changing demographics. My thesis is made up of three layers of demographic change: aging and longevity; the shift to ‘majority-minority’ where the internet is driven by a population of tech adopters from Asian, Black and Latino backgrounds; and womens’ increased earning and spending power. Many investors evaluate opportunities to invest in women exclusively through the lens of female founders (and we can’t talk about the opportunity in female consumers without acknowledging the dismal investment numbers for female founders), but there is a parallel opportunity in the female economy — investing in technology that solves the problems and meets the needs of female consumers. Women should no longer be thought of as a niche. In fact, they’re one of the most significant growth markets we’ve ever seen. This cohort is already driving companies to multi-billion-dollar outcomes in women’s health, e-commerce, the care economy and other categories. The decacorn valuation of SHEIN and the billion-dollar (or more) valuations of Maven Health, Faire, and Incredible Health are just a few examples of the enduring power of the female dollar. How did women become a growth market? Today, women make up roughly half of the U.S. working population and, when adjusted for self-employment, are the new workforce majority. Much of this growth was driven by gains in the retail and healthcare sectors, industries that employ more women and are heavily influenced by female spending power. The rise in female employment is also inextricably linked to education: As of 2019, almost half of the employed female population ages 25-64 held a bachelor’s degree or higher – representing a quadrupling of women with degrees since 1970. Today, women make up 59.5% of college students and even as enrollment in U.S. universities is declining, men account for 71% of that decline. If this trend continues, soon two women will earn a college degree for every one earned by a man. Even with a persistent wage gap, these factors have led to a dramatic increase in women’s financial power. American women control more than $10 trillion in assets (an amount expected to triple over the next decade), driven by a steady upswing in workforce participation, education and wage growth. Women are increasingly likely to be the primary bread-winner, financial contributor, and head of household, making 85% of day-to-day spending decisions and 80% of healthcare spending decisions for the family. Four key investment themes The pace of women’s economic activity has increased across every category. This impacts not just consumer categories like beauty, apparel, and household goods, but is also changing who becomes primary purchasers of housing, users of financial products like credit cards and mortgages, and decision-makers in the workplace. There are four major categories in which the needs of women have driven the acceleration of their consumer dollars: The “super consumer” Women have long been a target customer for retail and e-commerce, but the modern female consumer – a “super consumer” – exerts far more influence over the economy than ever before. A number of privately held unicorns and multi-billion-dollar market cap public companies can attribute their growth to a powerful and engaged female consumer base. Many would place billion-dollar beauty and fashion brands like Skims, SHEIN, and Savage x Fenty into the category of companies driven by female consumption. Dig deeper, and you’ll see the female consumer dollar drives both the acceleration of new consumer brands and associated activity around creators and influencers, e-commerce enablement, and supply chain. The influence of the female dollar can be felt in consumer-facing categories like education, healthcare, food, and financial technology. When thinking about the female consumer, it’s more appropriate to ask, ‘which industries are not influenced by the female dollar?’ Women’s health and wellness Women are the biggest consumers of healthcare based on both their own health needs as well as their role as primary healthcare decision-makers for their families. “Femtech” is now a widely recognized category of healthcare innovation, reaching $16 billion in investment as of Q3 2022, and is estimated to be a nearly $1.2 trillion industry by 2027. Companies like Tia Health and Kindbody have changed the user experience of healthcare for women and others like Alife and Gameto are fusing science with AI and data to modernize in vitro fertilization, ovarian disease, and menopause. The opportunities extend to maternal health, mental health, and at-home diagnostics – all areas that will see accelerated innovation in the coming years. In a post-Roe world and one in which women want to take more control over their healthcare, women’s health is poised to be one of the most active areas of innovation. The care economy As women have taken on more professional responsibilities outside the home, their caregiving responsibilities have not decreased. Dismissing caregiving as “women’s work” has allowed the category to go ignored and under-invested even in the wake of rising numbers of male caregivers and the flood of aging parents who will make new caregivers of many of us. Caregiving became a political talking point during the 2020 election and the Biden Administration put forth a 2024 budget proposing $750 billion in federal support for caregiving. Alongside this federal focus, there is significant market opportunity for technology that makes this care more accessible and affordable. Companies like Mirza are helping employers support working parents with caregiving subsidies that decrease childcare-related absences. There is a massive opportunity to build solutions that alleviate the financial burden of caregiving, support both professional and family caregivers, and make care more accessible and affordable for everyone. As women become our most highly educated workforce, we have to figure out how both care and work get done. Women at work During the pandemic, women in professional careers took up the tools of hybrid and remote work that have since reshaped the modern workplace. It is these professional women who have been driving the demand for emerging technologies and platforms fundamentally shifting the return to work. The future of non-white collar work is particularly relevant to women in categories like education, service jobs, healthcare, and professional caregiving. Labor marketplaces like ShiftMed and Vivian Health emerged to fill healthcare job shortages, focusing on different aspects of the skilled clinician job market. As technologies like artificial intelligence force the evolution of white-collar work, the non-white collar jobs where women are concentrated will find AI to become an accelerant to training and the elimination of some of the more tedious tasks and reporting requirements in these jobs. Looking ahead: Investing in women Today, women are more educated, active in the workforce, and more likely to start companies than ever before. Still, there is much progress to be made in harnessing their economic power. This gap is the alpha opportunity for investors.Investing in both women-led companies and commercial areas where women’s needs have yet to be met has the potential to unlock billions of dollars. Women should no longer be thought of as a niche. In fact, they’re one of the most significant growth markets we’ve ever seen. This white paper contains more of Cake Ventures’ research on demographic change. Unlocking the trillion-dollar female economy by Walter Thompson originally published on TechCrunch",
        "pubDate": "2023-05-21 09:30:14",
        "image_url": null,
        "source_id": "techcrunch",
        "category": ["technology"],
        "country": ["united states of america"],
        "language": "english"
      },
      {
        "title": "Google's potential competitor Neeva to shut down its search engine",
        "link": "https://tribune.com.pk/story/2417862/googles-potential-competitor-neeva-to-shut-down-its-search-engine",
        "keywords": ["Technology"],
        "creator": ["Tech Desk"],
        "video_url": null,
        "description": "Acquisition costs, economic environment and impact of generative AI and LLMs main reasons behind shutdown",
        "content": "Co-founded by former Google executive, Neeva announced that it is shutting down its consumer search engine on June 2, 2023. Neeva is known for being a private and ad-free search engine. Based on its features, the platform was being termed as a potential competitor to Google Search. In a , the company's cofounders Ramaswamy and Vivek Raghunathan narrated their struggles in building a search engine despite all the competition. They said, \"Building search engines is hard. It is even harder to do with a tiny team of 50 people who are up against entrenched organisations with endless resources.\" The cofounders admitted the existing competition and said, \"We've discovered that it is one thing to build a search engine and an entirely different thing to convince regular users of the need to switch to a better choice.\" The main reasons behind the shutdown are the increased cost of acquiring users, the current economic environment and the upcoming impact of generative Artificial Intelligence (AI) and Large Language Models (LLMs). The paid subscribers of Neeva Premium will get their refund, and all the user data will be deleted as a part of the shutdown. The platform will now be focusing on opportunities related to AI and LLMs. COMMENTS Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our",
        "pubDate": "2023-05-21 02:13:02",
        "image_url": "https://i.tribune.com.pk/media/images/needva1684653441-0/needva1684653441-0.png",
        "source_id": "tribune_pk",
        "category": ["technology"],
        "country": ["pakistan"],
        "language": "english"
      },
      {
        "title": "New AI voice coach may help treat depression, anxiety",
        "link": "https://www.orissapost.com/new-ai-voice-coach-may-help-treat-depression-anxiety/",
        "keywords": ["Feature", "Sci-Tech", "AI", "anxiety", "Depression"],
        "creator": ["Post News Network"],
        "video_url": null,
        "description": "New York: Artificial intelligence (AI) could be a useful tool in mental health treatment, according to a new study. The study, which was the first to test an AI voice-based virtual coach for behavioural therapy, found changes in patients’ brain activity along with improved depression and anxiety symptoms after using Lumen — an AI voice […]",
        "content": "New York: Artificial intelligence (AI) could be a useful tool in mental health treatment, according to a new study. The study, which was the first to test an AI voice-based virtual coach for behavioural therapy, found changes in patients’ brain activity along with improved depression and anxiety symptoms after using Lumen — an AI voice assistant that delivered a form of psychotherapy. The results, published in the journal Translational Psychiatry, offer encouraging evidence that virtual therapy can play a role in filling the gaps in mental health care, where waitlists and disparities in access are often hurdles that patients, particularly from vulnerable communities, must overcome to receive treatment. “We’ve had an incredible explosion of need, especially in the wake of Covid, with soaring rates of anxiety and depression and not enough practitioners,” said Dr. Olusola A. Ajilore, professor of psychiatry at the University of Illinois Chicago (UIC). “This kind of technology may serve as a bridge. It’s not meant to be a replacement for traditional therapy, but it may be an important stop-gap before somebody can seek treatment,” Ajilore added. The researchers recruited over 60 patients for the clinical study exploring the application’s effect on mild-to-moderate depression and anxiety symptoms, and activity in brain areas previously shown to be associated with the benefits of problem-solving therapy. Two-thirds of the patients used Lumen on a study-provided iPad for eight problem-solving therapy sessions, with the rest serving as a “waitlist” control receiving no intervention. After the intervention, study participants using the Lumen app showed decreased scores for depression, anxiety and psychological distress compared with the control group. The Lumen group also showed improvements in problem-solving skills that correlated with increased activity in the dorsolateral prefrontal cortex, a brain area associated with cognitive control. Promising results for women and underrepresented populations also were found. “It’s about changing the way people think about problems and how to address them, and not being emotionally overwhelmed,” said Dr. Jun Ma, Professor of Medicine at UIC. “It’s a pragmatic and patient-driven behaviour therapy that’s well established, which makes it a good fit for delivery using voice-based technology,” Ma added. IANS",
        "pubDate": "2023-05-21 01:50:27",
        "image_url": "https://i0.wp.com/www.orissapost.com/wp-content/uploads/2020/06/depression.jpg?fit=300%2C177=1",
        "source_id": "orissapost",
        "category": ["technology", "science"],
        "country": ["india"],
        "language": "english"
      },
      {
        "title": "G7 calls for developing global technical standards for AI",
        "link": "https://tribune.com.pk/story/2417861/g7-calls-for-developing-global-technical-standards-for-ai",
        "keywords": ["Technology"],
        "creator": ["Reuters"],
        "video_url": null,
        "description": "As per G7, governance of AI technology has not kept pace with its growth",
        "content": "Leaders of the Group of Seven (G7) nations on Saturday called for the development and adoption of technical standards to keep artificial intelligence (AI) \"trustworthy\", saying governance of the technology has not kept pace with its growth. While the G7 leaders, meeting in Hiroshima, Japan, recognised that the approaches to achieving \"the common vision and goal of trustworthy AI may vary\", they said in a statement the rules for digital technologies like AI should be \"in line with our shared democratic values\". The agreement came after the European Union, which participates in the G7, inched closer this month to passing legislation to regulate AI technology, potentially the world's first comprehensive AI law that could form a precedent among the advanced economies. \"We want AI systems to be accurate, reliable, safe and non-discriminatory, regardless of their origin,\" European Commission President Ursula von der Leyen said on Friday. The G7 leaders said they \"need to immediately take stock of the opportunities and challenges of generative AI\", a subset of the technology popularised by the ChatGPT app. OpenAI's ChatGPT pushed Elon Musk and a group of AI experts to raise an alarm in March calling for a six-month pause in developing more powerful systems, citing potential risks to society. A month later, EU lawmakers urged world leaders to find ways to control AI technologies, saying they were developing faster than expected. The United States so far has taken a cautious approach on governing AI, with President Joe Biden last month saying it remained to be seen whether AI is dangerous. Sam Altman, CEO of Microsoft-backed OpenAI, told a Senate panel on Tuesday that the US should consider licensing and testing requirements for development of AI models. Japan, this year's chair of G7, has been even more accommodative, pledging support for public and industrial adoption of AI while monitoring its risks. \"It's important to properly deal with both the potentials and risks,\" Prime Minister Fumio Kishida told the government's AI council last week. The Western nations' differing approaches to AI are in contrast to China's restrictive policy. Its cyberspace regulator in April unveiled draft measures to align generative AI-powered services with the country's core socialist values. While acknowledging differences on how AI should be regulated, the G7 leaders agreed on Friday to create a ministerial forum dubbed the \"Hiroshima AI process\" to discuss issues around generative AI, such as copyrights and disinformation, by the end of this year. The leaders also urged international organizations such as the Organisation for Economic Cooperation and Development to consider analysis on the impact of policy developments. The summit followed a G7 digital ministers' meeting last month, where its members - the US, Japan, Germany, Britain, France, Italy, Canada and the EU - said they should adopt \"risk-based\" AI rules. The EU and US are also expected to exchange views on the emerging technologies at the Trade and Technology Council in Sweden on May 30-31. COMMENTS Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our",
        "pubDate": "2023-05-21 01:33:16",
        "image_url": "https://i.tribune.com.pk/media/images/Leaders-attend-a-working-session-during-G7-summit-1623583651-0/Leaders-attend-a-working-session-during-G7-summit-1623583651-0.jpg",
        "source_id": "tribune_pk",
        "category": ["technology"],
        "country": ["pakistan"],
        "language": "english"
      }
    ],
    "nextPage": "16846327960c144e6efbd6a50101520668ab376003"
  }
]
